<?php
//Романич, [24.04.20 21:05]
//чекай, всеодно не поняв що ти маєш на увазі тіпа підключкення файл, ти тіпа у функції include '*.php' будеш писати?
//
//    Романич, [24.04.20 21:05]
//add_action( 'woocommerce_before_shop_loop', 'ma_discounts_block');
//function ma_discounts_block() {
//    include '*.php';
//}
//
//Романич, [24.04.20 21:05]
//таке?
//
//    Mykola Mykolayovych, [24.04.20 21:06]
//ага типу такого
//
//Романич, [24.04.20 21:06]
//нічо
//
//Романич, [24.04.20 21:06]
//просто у файлі може не працювати звичайний цикл
//
//Романич, [24.04.20 21:06]
//тіпа have_posts()
//
//Романич, [24.04.20 21:07]
//треба буде доставати через wp_query
//
//Романич, [24.04.20 21:07]
//$query->post()